In [1]:
import pandas as pd
import re

In [2]:
df_raw = pd.read_csv(
    '../data/interim/job_offers.csv',
    sep=';',
    encoding='UTF-8'
)
df_raw.head()

,name,company,technology,job,location_city,location_country,salary_low,salary_high,salary_currency,salary
0,Business Analyst/Senior Business Analyst,SoftServe,NaN,data analyst,Zdalna,NaN,11000.0,21500.0,PLN,NaN
1,Power BI Developer / Data Analyst,Objectivity,NaN,data analyst,Zdalna,NaN,14000.0,20000.0,PLN,NaN
2,Junior Data Analyst,Coinfirm,NaN,data analyst,Zdalna,NaN,3100.0,5000.0,PLN,NaN
3,Data Analyst,Packhelp,NaN,data analyst,Warsaw,POL,13000.0,15000.0,PLN,NaN
4,Data analyst (analityk danych),Alterdata.io sp. z o.o.,NaN,data analyst,Zdalna,NaN,12000.0,18000.0,PLN,NaN

In [3]:
df = df_raw.copy()

df['name'] = df['name'].str.lower()
df['location_city'] = df['location_city'].str.lower()

In [4]:
df['salary_avg'] = (df['salary_low'] + df['salary_high'])/2

In [5]:
df['location_city'].unique()

array(['zdalna', 'warsaw', 'warszawa', 'kraków', 'gdańsk', 'wroclaw',
       'poznań', 'krakow', 'malbork', 'budapest', 'łódź', 'sopot'],
      dtype=object)

In [6]:
df.loc[df['location_city'].isin(['warsaw', 'warszawa']), 'location_city'] = 'warszawa'
df.loc[df['location_city'].isin(['gdańsk', 'gdansk']), 'location_city'] = 'gdańsk'

In [7]:
df.loc[
    (df['location_city'] == 'zdalna') &
    (df['location_country'].isnull()),
    'location_country'] = 'B/D'

In [8]:
df['is_senior'] = 0
df.loc[df['name'].apply(lambda x: True if re.match('(?i)(senior)', x) else False), 
'is_senior'] = 1

In [9]:
df = df.loc[df['salary_currency'] == 'PLN']

In [10]:
df.to_csv('../data/processed/job_offers.csv',
    sep=';',
    encoding='UTF-8',
    index=False)